= ともみ

岩手大学人文社会科学部４年次
フランス語専攻(ペーペー)

((<GHK|URL:http://www.geocities.co.jp/CollegeLife-Circle/5769/>))所属

もう引退しましたが、寂しいので何かしら顔をだしています。
部ではラジオのパーソナリティを主にやっていました(ペーペー)。

== COZMIXNGでは
♪インターネットラジオを配信(？)する。
著作権の問題があるので、地域のアマチュアバンドや
ＤＪの方達から、オリジナルの楽曲を提供してもらおうと
思っています。お持ちの方、ご一報下さい☆

今は著作権フリーの曲を探しています。

♪2002年にちょっとフランスに行って来たので
そちらの写真を((<ギャラリー|URL:http://pub.cozmixng.org/~gallery/>))にのせさせてもらっています。
これからも増やす予定です。
今年も行くかもしれないので、こんな写真がみたい！
などありましたらご一報下さい。

最近((<Webサイト|URL:http://pub.cozmixng.org/~momi/>))を作り上げました☆遊びにいらして下さい。

