= 活動

COZMIXNGの活動に関することです．

  * ((<'03冬--ネットワーク連絡会>))
  * ((<今後の展開>))
  * ((<ネタ>))
  * ((<著作権>))
  * ((<利用規約>))
  * ((<COZMIXNGの遊び方>))
  * ((<COZMIXNGの今後を考える会>))

== スライド

以下のページではメニューに「 スライド」とでます。

  * ((<COZMIXNGって何？>)) for 2003/3/5の呑み会
  * ((<COZMIXNGに注目！>)) for 2003/4/26のSPERng研究会
  * ((<COZMIXNGで何をする？>)) for 2003/7/25のネットワーク連絡会
  * ((<COZMIXNGが今熱い>)) for 2003/10/11のSPERng研究会
  * ((<広がるCOZMIXNG>)) for 2004/1/23のネットワーク連絡会
  * ((<参加者募集>)) for 2004/7/30のネットワーク連絡会
  * ((<地域ネットワークのこれから>)) for 2005/1/8のネットワーク連絡会
