= 著作権

yoshidaです。昨日の会合時に著作権の話や質問が出ましたので、この場を借りて少し詳しい話をしておこうと思います。
参考文献は、文部科学省著作権課長　岡本薫、“インターネット時代の著作権”、（財）全日本社会教育連合会 です。

== 放送とインタラクティブ送信
インターネットでのストリーミングやホームページなどによる配信は、サーバを介して行われるため「インタラクティブ
送信」と呼ばれて、TVなどの「放送」とは区別されています。その必要理由の一つは、TV局などの放送局が特権を持って
いるためで、そのような特権を多くの人に認めることが出来ないという理由からです。

== 米国の著作権法
米国の著作権法では、インタラクティブ送信に関する明確な規程はないようです。
国際的には、1996年12月に「WIPO新条約」（インターネット条約）で方向が定まり、著作者、実演者、レコード製作者に
インタラクティブ送信の権利を与えなければならなくなりました。しかし、米国は著作権法に「送信可能化権」を含めな
かったために、個々の問題に対して裁判所が判断を下さなければならなくなりました。プレイボーイ事件、ナップスター
事件などが、米国の法律の不備を露呈させたと言われています。

十分な法整備が行われていない国では、インタラクティブ送信の著作権が認められない状況のところもあります。
そのような国にサーバを置けば、日本の著作権法からは逃れることができてしまいます。
一刻も早い、法整備が望まれるところです。

== 教育利用では、チャレンジングに！
本日、文部科学省のメディア教育開発センターで遠隔教育等に取り組んでおられる方からお話をお聞きしました。
それによると、日本の著作権制度はちょっと固いので、あまり気にしていると世界から取り残される、という励ましのお
言葉をいただきました。疑問があれば、いつでもアドバイスしてくださるという心強いお言葉もまたいただきました。

