= 今後の展開

COZMIXNGの今後についてはここに書いておきましょう。

== NPO設立

NPO設立の時期は？プロバイダが集まって来る前？集まって来た頃？みんな揃った頃？個人的には早い方がいい気がします。 - ((<kou>))

自主製作映画の方々もNPOを設立して活動しているそうです。今度呑み会に来たときにどんな流れになるのか聞いておいたらどうでしょう。 - ((<kou>))

「((<NPOを設立する>))」とは、具体的に何をすることになりますか？中立的な立場の表明というのはいいと思うのですが、モノとか、場所とか、どうなるのでしょう？まだイメージがつかめません。- ((<szk>))

  * とりあえずこんなとこを見つけました。((<NPO設立|URL:http://plaza13.mbn.or.jp/~kgo/npo.htm>))。社員10人とか税金かかるとかすぐに動けるというものではなさそうです。でもいつまでも岩大で動いているわけにもいかないし。。。 - ((<kou>))

== ドメイン取得

((<VALUE DOMAIN|URL:https://www.value-domain.com/>))でcozmixng.orgを取得
