= 利用規約(案)

== はじめに

COZMIXNGは，盛岡地区インターネット相互接続(COZMIX)上でその特
性を活かしたサービス(以降，「((<本サービス>))」)を提供する団体であ
る．本サービスをを提供するにあたり次に掲げる利用規約を定める．

以降，COZMIXNGのリソースを使用してサービスを提供する者を「提
供者」，COZMIXNG上のサービスを利用するものを「((<利用者>))」と呼ぶ，
また，「((<提供者>))」と「((<利用者>))」を総称して「((<参加者>))」と呼ぶ．


== 規約適用範囲と改定

  (1) COZMIXNGと参加者間に生じる一切の関係に適用されるものと
      する．

  (1) 本規約は参加者がCOZMIXNGに参加した日から効力が生じるも
      のとする．参加とは，提供者ならばCOZMIXNGのリソースへの
      アクセス権が認められること，利用者ならば本サービスを利
      用することである．

  (1) COZMIXNGは参加者の承諾を得ずに，本規約の変更・改訂がで
      きるものとする．


== 利用契約

  (1) 提供者がCOZMIXNGに必要事項を通知の上，申し込みを行い，
      COZMIXNGが承認して提供者にCOZMIXNGのリソースへのアクセ
      ス方法を通知し，提供者がそれを受け取った時点で成立する
      ものとする．

  (1) COZMIXNGの判断によって，申し込みを承諾しない場合がある
      ものとする．この場合，その理由を提供者に報告する必要は
      ないものとする．

  (1) COZMIXNGは参加者に対し，事前に通知することなく，本サー
      ビスの変更・廃止をできるものとする．これにより，参加者
      が被る一切の損害に対してCOZMIXNGは一切の責を負わないも
      のとする．

  (1) 本サービスは無料である．

== 参加者の義務

  (1) 本サービスに関するパスワードを取得した参加者は，パスワー
      ドを忘失もしくは盗難された場合は，直ちにCOZMIXNGに通知
      しなければならないものとする．

  (1) 本サービスに関するパスワードは参加者が一切の責を負うも
      のとする．提供者は提供者の提供するサービスに関する一切
      の責も負うものとする．

  (1) 利用者は次節の禁止事項に違反してはいけないものとする．
      また，提供者は提供者の提供するサービスの利用者が次節の
      禁止事項に違反していないか常に監視しなければならないも
      のとする．


== 禁止事項

  (1) 下記内容を含む利用は禁止とする．下記内容を発見した場合，
      提供者は速やかにこれを削除しなければならない．

      * 日本国，及びそれ以外の国の法律，法令，条例等に違反，抵
        触する内容

      * プライバシーや著作権，その他の権利を侵害するような内容

      * 猟奇ものなど閲覧者に不快感や精神的悪影響を与えるような
        内容

      * アダルトや明らかに性行為を連想させるような内容

      * 特定の個人や企業，団体，国，人種などへの誹謗中傷を含む
        内容

      * 営利目的で本サービスを利用，または二次利用すること

      * 広告を表示すること

      * 参加者から，第三者への本サービスを受ける権利の譲渡・貸
        与

      * その他COZMIXNGが不当と判断した一切の行為

== 免責事項

  (1) 本サービスの利用に起因する参加者の損害について，
      COZMIXNGは一切の責を負わないものとする

  (1) 本サービスを利用することによって，参加者が他の参加者ま
      たは第三者に損害を与えた場合，当該参加者は自らの費用と
      責任において問題を解決する義務を負い，COZMIXNGを一切免
      責するものとする．

  (1) COZMIXNGは，本サービスの継続提供に関し，一切，保証しな
      いものとする．本契約や運営上及び状況の変化により，本サー
      ビスを中止，または提供を中止した場合，参加者はこれに承
      諾するものとする．

  (1) 参加者への本サービスの提供が中止された場合でも，
      COZMIXNGにはその理由についての報告義務は生じないものと
      する．

== プライバシーポリシー

  (1) COZMIXNGは，以下の場合を除いて，参加者から得た個人的情
      報を第三者に開示することはないものとする．

      * 参加者本人からの依頼による場合
      * 参加者から事前に許可を得た場合
      * 法律的な義務(裁判所からの命令など)が生じた場合
      * その他，COZMIXNGが復旧・保守のために必要と認めた場合
