= COZMIXNGって何？

  * 盛岡地域インターネットエクスチェンジ
  * それを運用・管理するための団体名
    * 名前の由来はCOZMIXにNext Generation(次世代)を付けただけ

  * ポリシーは
    * 気楽に
    * 楽しく
    * 好きなことを

  * 楽しくなかったらやめてもらって構いません

= インターネットエクスチェンジ？

  * インターネットは小さいネットワークの集まり
  * ネットワーク同士をつなぐものが必要
    * => それがインターネットエクスチェンジ
  * IX(Internet Exchange)と言われることもある

= なんで盛岡にIXをつくるの？

  * 盛岡にIXがないから
    * => 盛岡近郊のネットワーク間は直接つながっていない
      * => 物理的には近くにあるのに遠回りしなければいけない

= 何が嬉しいの？

  * データを送ってもロスが少ない
  * 周辺地域に有利なサービスが提供できる

= サービス？

  * ストリーミング
  * 無料Webスペース提供
  * 面白そうなもの

= ストリーミング？

  * ストリーム(stream)は流れという意味
  * ユーザ(クライアント)は普通は以下のようにサービスを受ける
    (1) サービスを提供している機械(サーバ)を探す
    (1) サーバからデータ(音や動画やホームページ等)を送ってもらう(ダウンロード)
    (1) ユーザはデータを(({全て}))受け取ったら演奏、表示等を開始する
  * ストリーミングとはデータは(({受け取りながら}))演奏、表示等をする
    * => 大量のデータでも演奏、表示されるまで長く待つ必要は無い
    * => 演奏、表示している間はずっとダウンロードしていなければいけない
  * ブロードキャスト(放送)する事も出来る
    * 複数の人が同じ時間に同じ内容のデータを受け取る
    * テレビやラジオと同じ

= 面白そうなもの？

  * = やってみたいもの
  * 案
    * 地域紙みたいなサービス
  * 動くもの
    * 偽WebMail
    * ギャラリー自動生成

= 地域紙みたいなサービス

  * 市澤さんの案
  * 地域紙のようなものをWeb上に
    * 「あげます」「ください」のようなもの
    * 地域の人たちみんなが編集者

= 偽WebMail

  * 松館さんの案
  * 実装は須藤
  * 本当に(携帯やパソコンに)メールを送ることは(({出来ない(しない)}))
  * 内部で完結
    * 偽WebMailを使っている人達だけで送受信できる
      * => 失敗(宛先を間違える等)しても被害は少ない
    * 好きなことが出来る
      * => ユーザ名等に日本語が使用できる(初心者にもやさしい？)
  * メールの設定をする必要はない
  * ホームページを見れる環境だけ整えればいい
    * => 違うパソコンでもホームページさえ見れれば同じ環境でメールが読み書きできる
  * ちょっと宣伝
    * ((<Linux Software Search|URL:http://lss.eternity.ne.jp/cgi-bin/link/lss_frame.cgi?soft_add.cgi?4666>))からリンクを張られている
  * ((<ここ|URL:http://pub.cozmixng.org/~pwm/>))で動いている

= ギャラリー自動生成

  * 案、実装ともに須藤
  * 藤舘さん曰くホームページを管理するのは面倒だ
    * 一般の人はたぶんそうだろう
    * 面倒なものは機械にやらせれば良い
  * 画像をホームページ上で公開しようとするとHTML等を勉強しなければいけない
    * => 初心者には敷居が高い？
  * 画像を公開したい人は画像を作成(撮影)、編集することだけに集中すれば良い
    * => 画像からページ(ギャラリー)を生成する部分は機械にやらせれば良い
  * これを使えば。。。
    * => HTML等を覚える必要はほとんど無い
    * => FTPの設定などをする必要は無い
  * 表示のカスタマイズはCSSを用いれば結構いろんなことが出来る
  * ((<ここ|URL:/~kou/gallery/>))で動いている

= 今後の展開

  * NPO(非営利団体)設立？
    * NPOだからと言って儲けてはいけないというわけではないらしい
    * だれか詳しい人いませんか？
  * ドメイン取得
    * cozmixng.org?
      * .org(organization)は団体/組織という意味
    * cozmixng.net? 
      * .net(network)ネットワーク関係という意味

= 連絡先

  * メーリングリスト(ML)
    * => 参加者でメールを共有できる。
    * COZMIXNGで使っているのは((<QuickML|URL:http://www.quickml.com/>))
      * 携帯メールでもすぐに作れる
  * WikiWiki
    * 誰でも書き換え可能なWebページ
    * 掲示板より自由度の高いもの

= まとめ

  * IXつくるだけじゃ面白くないからいろんなことやろう
  * やるんだったら楽しくやろう
    * 仕事だと義務みたいになるから嫌だ
    * これは趣味(遊び)です！
  * お金はありません
    * 払う気もないけどもらう気もない(寄付なら喜んで)
  * 興味がある人なら大歓迎
  * 興味が無くなったら遠慮なくやめてもらって構いません
    * 興味が無いのにやったって面白くないでしょ？

= 最後に

  * 一緒に遊びましょう！

