= COZMIXNGの今後

COZMIXNGの今後の行く末について話し合われた内容，こうしてはどうかなどという意見をまとめていきましょう．

== カテゴリー付きリンク集はどう？ in COZMIXNGの遊び方2の後の会

この案のイメージは以下のとおり．イメージのしたに説明があります．違う大きさのものを見たかったら((<こちら|URL:http://pub.cozmixng.org/~gallery/ichisawa/cozmixng.jpg.html.en>))へ．

((<イメージ図|"img:http://pub.cozmixng.org/~gallery/ichisawa/cozmixng_50%25x50%25.jpg">))

* 今後、岩手の学生や学生の団体をとりあえず主体にしてウェブ提供サービスや、ニュース配信といった事をしていったらどうか。

** もしここで実績が出来れば、学生以外でも使ってくれる人がでて、岩手のページと言えばcozmixngと言われるようになるかもしれない

* Yahoo(や@ITとか)のように趣味などのカテゴリに分けてそれぞれのトップページを作る。（たとえば、野球といったカテゴリやPCといったカテゴリ）

** そして、それら別々のトップページには、そのカテゴリに関係するニュースなどを流す。（yahooや岩手日報などからのニュースや、cozmixngから出た情報、個人（もしくは団体）のCMなど）

** ニュース告知などの主な趣旨は、cozmixngを常に見てもらうサイトにしなければ、一時的にCozmix面白いと思い、コンテンツを提供してくれても、それ以上発展しないと考えた為。

* それぞれのカテゴリには、さらにその下に繋がる個人（もしくは団体）のサイトが出来、トップからリンクがされたり人気ページとして紹介されたりする。

** 個人（もしくは団体）のページは複数のカテゴリに登録する事も可能

* さらに個人（もしくは団体）は自らの趣味に合わせてコンテンツ配信を行う事が出来る。（例として写真や音楽や映像）

* ニュース配信やスペース提供やコンテンツ配信やCMなどの情報の告知に関しては全て無料とする。

== 学祭でデモしてはどうか？ in COZMIXNGの遊び方2の後の会

Cozmixngはもっとどのような事をしているのか告知する必要があると考えた。

* 岩大の学祭でCozmixngの告知をしてみたいと思う。

* デモをするときにポスターを貼って、ビラを配って、どのような事をしているのか説明したい。

* デモを行う場所を間借り出来ないか。

* ビラの作成でCozmixngについてのイメージを描いてくれる人と僕らが実際ミーティングをして、一緒に考えてみたい。

* 一般の方と話してCozmixngをどう感じるのか話し合ってみたい。

** １０月の始めに一度ミーティングを開きたいと考えている。詳しくは((<COZMIXNGの今後について考える会|URL:http://pub.cozmixng.org/~rwiki/index.rb?cmd=view;name=COZMIXNG%A4%CE%BA%A3%B8%E5%A4%CB%A4%C4%A4%A4%A4%C6%B9%CD%A4%A8%A4%EB%B2%F1>))
