= COZMIXNGで何をする？

== 持ち時間

30分

== ポリシー

デモ(動いているところ)を多く見せよう

== 話す内容

()内は所要時間．単位は分

  * Wiki(10)

    * WiLiKi
      * 講義でのWiki

    * RWiki
      * プラットフォーム？
      * アプリケーションサーバ？

      * RSSとの絡みを少し
  
    * ImportWikiの話しもしたいなぁ．

  * ギャラリー(10)

  * Pseudo Web Mail(5)

  * その他(5)
    * ストリーミング
    * Ruby/RSS
    * COZMIXNGについて(最初に)
    * まとめ(最後に)

== 最後に言うこと

((*COZMIXNGは場である（ポテンシャルを持っています）*))

= COZMIXNG？

((*COZMIX*)) ((*N*))ext ((*G*))eneration

((<"img:http://www.cozmixng.org/repos/images/cozmix_and_cozmixng.png">))

= WikiWikiWeb

  * 誰でも書き換え可能なWebページ

  * ドキュメントの共有/共同作成

  * 気軽に自分のページを作成


= Wikiをつなぐ

  * InterWikiName

    * 外部のWikiへのリンクを張るショートカット

  * ImportWiki

    * 外部のWikiを取り込む

  * RSS

    * 他のWebサイトの更新状況を把握

= ギャラリー

((<URL:http://pub.cozmixng.org/~gallery>))

  * 画像を用意するだけでHTML/Flashを生成

  * インターフェイスはCGIまたはメール

= Pseudo Web Mail

  * SMTPやPOP/IMAPを使わないWebメールシステム

  * rubyさえ動けば利用可能

= あなたは何をする？

((*COZMIXNGは場*))

  * Webスペース

  * Webアプリケーション

    * ギャラリー

    * Pseudo Web Mail

    * Wiki

    * Web日記(tDiary)

  * ストリーミング

  * アナログとディジタルのネットワークの融合

  * and anything you like!!!!

= OK, let's play with COZMIXNG!

さぁ，COZMIXNGで遊びましょう！


== とりあえずここまで

== 話すことのメモ

とりあえず，何をやっているかということをごにょごにょ．

  * サーバソフトとか作ったアプリケーションとかを詳しく説明する(ウンチクを語る)というマニアックなのにしようと思うんですけど，いいですか？
  * いいと思いますが，皆さん引くかも．- ((<szk>))

    * [2003-06-24] やっぱり．．．来る人達はどういうのが好みなんですかねぇ．新しい技術とか世間の動向とかですか？それともこんなことやってますとかですか？

Wikiの話もごにょごにょ．

  * Wikiを講義で使っていて気付いたこととかを箇条書でいいんでメモっておいてもらえますか？
  * 了解です．自分でもまとまっていないので，思い付いたことをメモしておきます．- 6/24 ((<szk>))
    * Wikiを使っている講義　計算機ネットワーク，ソフトウェア構成論，言語処理系特論
    * 書き込みながらWikiで講義は，ちょっと自分の技術が追い付かない．
      * コメントで隠しておいてやるときにコメントを消すと何とかなる

    * 学生の評判はいいと思う．

      * ノートを取らなくてもいいので聞くことに集中できる

      * 後から見れる

    * 書き込みは，少ない．書こうとは思うらしいが．．．

    * 何度も同じ箇所を講義できる．
    * 学生はいつもWebを見られる環境にはいない．いないことの方が多い．
    * オンラインで講義しないとあまりうれしくない

  * 私は研究室で使ってみたWikiとかを書いておくかもしれません．

=== 講義でWikiのメモ　
03/06/24 opened ... 

* 計算機ネットワーク
  * TCP/IP の仕組みを理解するのが目的
    * 普段使っているUnixで実感できるといい
      * 無理っぽい
  * Wiki ページの内容
    * 講義に関する情報
    * 講義ノート
      * 教科書のまとめ
      * 私の考え
      * 掲示板
        * あまり使われない
    * 関連する話題 Unix, network, 身の回りのネットワークがどうなっているか...

  * Wikiにしていいこと
    * 以前は話してその場で消えていった内容が書き留められる
    * 講義内容に自分でコメントできる．
    * 何度も同じ内容を講義できる．最初の説明だけではわからなかった時など
    * リファクタリングできる

  * Wikiにのせられない・のせないもの
    * Unix でのネットワーク関連コマンドの実行例
  * 困っていること
    * 用語などへのリンク
      * フォーマルな解説をするリンク先が見つからない
        * 学生が参加してくれれば解決できる？？？

* ソフトウェア構成論
  * 内容
    * 講義に関する情報
    * 講義ノート　-

* Wikiで講義ノートを作ってみて

  * 自分の考えがまとめられた

  * 後半年やらないとわからない

    * 一年後に期待
