= COZMIXNGの今後を考える会

((<COZMIXNGの遊び方2|URL:http://www.cozmixng.org/?date=20030912>))で話し合ったCOZMIXNGの行く末をもう少し煮詰めてみようじゃないかという会．

話し合った内容は((<COZMIXNGの今後>))を参照．

== 参加して欲しい人

今回は，いろいろな方向からの視点を知りたい/尊重したい/議論し
たいため，COZMIXNGへの参加の有無/技術力/年令/趣味などを問わ
ず，様々なタイプの方に参加して頂いて，意見を伺いたいと思って
います．その結果，お互いに何か得るものがあれば幸いです．

== 開催予定日

  * 日時: 10/2(木)18:00開始
  * 場所: 岩手大学総合情報処理センター2階つきあたりの端末室

== 各自の予定

出来るだけ多くの人が参加できるように開催日を調整したいと思います．以下に参加できそうな日時を書き込んで下さい．

  * ((<kou>)): 火曜，水曜以外ならだいたい大丈夫かな？
  * ((<momi>)): 講義ないのでオーケイです。サヨナラ陰陽師２の試写会・・・   (>_<)/~~
  * ((<szk>)): 18時以降なら、ほとんど大丈夫。
  * ((<ライデン>)): ＭＬでは、可能のような話をしましたが、授業が始まると、月〜木の夜は辛いです。（電車通学のため・・・）

== 参加者

== 内容

((<WiLiKi:COZMIXNG:coz>))
